Revit 2024 API
BuiltInFailures.EditingFailures.PlacementFailed Property
 Failed to place component.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PlacementFailed { get; }
Visual Basic
Public Shared ReadOnly Property PlacementFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PlacementFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace